{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.7.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 150], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 100000, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional", "trainable": true, "dtype": "float32", "layer": {"class_name": "GRU", "config": {"name": "gru", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.2, "implementation": 1, "reset_after": true}}, "merge_mode": "concat"}, "name": "bidirectional", "inbound_nodes": [[["embedding", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "global_average_pooling1d", "inbound_nodes": [[["bidirectional", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "global_max_pooling1d", "inbound_nodes": [[["bidirectional", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate", "inbound_nodes": [[["global_average_pooling1d", 0, 0, {}], ["global_max_pooling1d", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 6, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense", 0, 0]]}}, "training_config": {"loss": "binary_crossentropy", "metrics": ["accuracy"], "loss_weights": null, "sample_weight_mode": null, "weighted_metrics": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.001, "decay": 0.0, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of29.bin", "group1-shard2of29.bin", "group1-shard3of29.bin", "group1-shard4of29.bin", "group1-shard5of29.bin", "group1-shard6of29.bin", "group1-shard7of29.bin", "group1-shard8of29.bin", "group1-shard9of29.bin", "group1-shard10of29.bin", "group1-shard11of29.bin", "group1-shard12of29.bin", "group1-shard13of29.bin", "group1-shard14of29.bin", "group1-shard15of29.bin", "group1-shard16of29.bin", "group1-shard17of29.bin", "group1-shard18of29.bin", "group1-shard19of29.bin", "group1-shard20of29.bin", "group1-shard21of29.bin", "group1-shard22of29.bin", "group1-shard23of29.bin", "group1-shard24of29.bin", "group1-shard25of29.bin", "group1-shard26of29.bin", "group1-shard27of29.bin", "group1-shard28of29.bin", "group1-shard29of29.bin"], "weights": [{"name": "bidirectional/forward_gru/gru_cell_1/kernel", "shape": [300, 192], "dtype": "float32"}, {"name": "bidirectional/forward_gru/gru_cell_1/recurrent_kernel", "shape": [64, 192], "dtype": "float32"}, {"name": "bidirectional/forward_gru/gru_cell_1/bias", "shape": [2, 192], "dtype": "float32"}, {"name": "bidirectional/backward_gru/gru_cell_2/kernel", "shape": [300, 192], "dtype": "float32"}, {"name": "bidirectional/backward_gru/gru_cell_2/recurrent_kernel", "shape": [64, 192], "dtype": "float32"}, {"name": "bidirectional/backward_gru/gru_cell_2/bias", "shape": [2, 192], "dtype": "float32"}, {"name": "dense/kernel", "shape": [256, 6], "dtype": "float32"}, {"name": "dense/bias", "shape": [6], "dtype": "float32"}, {"name": "embedding/embeddings", "shape": [100000, 300], "dtype": "float32"}]}]}